[
  {
    "id": 1,
    "title": "سماعة الترجمة الفورية Y113",
    "description": "اكتشف العالم وتواصل بلا حدود مع سماعة Y113، رفيقك المثالي للسفر والمحادثات الدولية. هذه ليست مجرد سماعة، بل هي جسر يربطك بالثقافات المختلفة عبر ترجمة فورية ودقيقة لعشرات اللغات. انغمس في محادثات طبيعية وسلسة، أو استمتع بتجربة صوتية نقية وغامرة عند الاستماع للموسيقى وإجراء المكالمات. تصميمها الأنيق والمريح يجعلها مثالية للاستخدام طوال اليوم، سواء كنت في اجتماع عمل، أو تستكشف مدينة جديدة، أو تسترخي مع قائمة أغانيك المفضلة.",
    "price": 19.99,
    "category": "سماعة ترجمة",
    "image": "https://m.media-amazon.com/images/I/61rZMc5+EfL._AC_SL1500_.jpg"
  },
  {
    "id": 2,
    "title": "هاتف ذكي فلاجشيب برو X",
    "description": "أطلق العنان لإبداعك مع هاتفنا الذكي الرائد، المصمم ليتجاوز كل توقعاتك. التقط صورًا تحاكي الواقع بفضل نظام الكاميرا الثوري الذي يحول كل لقطة إلى تحفة فنية، حتى في أصعب ظروف الإضاءة. انغمس في عالم من الألوان الزاهية والتفاصيل المذهلة على شاشته السينمائية عالية الدقة. وبفضل أدائه الخارق ومعالجه فائق السرعة، ستستمتع بتجربة استخدام سلسة ومذهلة، سواء كنت تتنقل بين التطبيقات أو تخوض أشرس المعارك في ألعابك المفضلة.",
    "price": 980.50,
    "category": "هواتف ذكية",
    "image": "https://via.placeholder.com/500x500.png?text=Smartphone"
  },
  {
    "id": 3,
    "title": "سماعات ProSound Elite",
    "description": "اهرب من ضجيج العالم وانغمس في عالمك الخاص مع سماعات ProSound. صُممت لتوفر لك تجربة استماع لا مثيل لها، حيث تعمل تقنية إلغاء الضوضاء النشطة على عزلك تمامًا لتستمتع بكل نغمة وكل كلمة بوضوح استثنائي. اشعر بعمق الموسيقى وصفاء المكالمات بجودة صوت تضاهي الاستوديوهات الاحترافية. تصميمها المريح يضمن لك ساعات من الاستماع دون أي إزعاج، مما يجعلها الرفيق المثالي في تنقلاتك اليومية وفي لحظات تركيزك واسترخائك.",
    "price": 150.75,
    "category": "ملحقات",
    "image": "https://via.placeholder.com/500x500.png?text=Wireless+Earbuds"
  },
  {
    "id": 4,
    "title": "ساعة ذكية WatchFit 5",
    "description": "ارتقِ بأسلوب حياتك مع ساعة WatchFit 5، شريكك الصحي الأنيق الذي يجمع بين التصميم العصري والتكنولوجيا المتقدمة. تتبع أهدافك للياقة البدنية بدقة متناهية، وراقب مؤشراتك الصحية من معدل نبضات القلب إلى جودة نومك. تتيح لك شاشتها من نوع AMOLED ذات الألوان الغنية والساطعة رؤية إشعاراتك وتطبيقاتك بلمحة واحدة. هي أكثر من مجرد ساعة، إنها مساعدك الشخصي الذي يبقيك متصلاً ومتحفزاً وأنيقاً في كل خطوة.",
    "price": 220.00,
    "category": "أجهزة قابلة للارتداء",
    "image": "https://via.placeholder.com/500x500.png?text=Smartwatch"
  }
]
